results/r5-b_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 16628.69 qps: 166293.77 (r/w/o: 166293.77/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 18061.61 qps: 180615.99 (r/w/o: 180615.99/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 19429.24 qps: 194292.69 (r/w/o: 194292.69/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 19776.85 qps: 197768.54 (r/w/o: 197768.54/0.00/0.00) lat (ms,95%): 1.96 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 20760.99 qps: 207611.17 (r/w/o: 207611.17/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 20806.18 qps: 208060.88 (r/w/o: 208060.88/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 20807.44 qps: 208075.18 (r/w/o: 208075.18/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 20691.84 qps: 206918.49 (r/w/o: 206918.49/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 20783.25 qps: 207832.06 (r/w/o: 207832.06/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 20869.39 qps: 208692.24 (r/w/o: 208692.24/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 20810.17 qps: 208103.92 (r/w/o: 208103.92/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 20930.96 qps: 209309.31 (r/w/o: 209309.31/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 20924.85 qps: 209247.79 (r/w/o: 209247.79/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 20781.78 qps: 207818.33 (r/w/o: 207818.33/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 20951.20 qps: 209510.07 (r/w/o: 209510.07/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 20919.60 qps: 209198.96 (r/w/o: 209198.96/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 20752.50 qps: 207523.64 (r/w/o: 207523.64/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 20862.77 qps: 208627.72 (r/w/o: 208627.72/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 20964.75 qps: 209646.84 (r/w/o: 209646.84/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 20834.98 qps: 208351.18 (r/w/o: 208351.18/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 20995.21 qps: 209951.56 (r/w/o: 209951.56/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 21022.19 qps: 210220.88 (r/w/o: 210220.88/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 20657.57 qps: 206575.88 (r/w/o: 206575.88/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 20767.64 qps: 207676.49 (r/w/o: 207676.49/0.00/0.00) lat (ms,95%): 1.86 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 20884.89 qps: 208848.72 (r/w/o: 208848.72/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 20931.20 qps: 209311.83 (r/w/o: 209311.83/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 20896.82 qps: 208967.67 (r/w/o: 208967.67/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 20973.05 qps: 209729.91 (r/w/o: 209729.91/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 20873.50 qps: 208738.11 (r/w/o: 208738.11/0.00/0.00) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 20964.75 qps: 209646.04 (r/w/o: 209646.04/0.00/0.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            123263770
        write:                           0
        other:                           0
        total:                           123263770
    transactions:                        12326377 (20543.49 per sec.)
    queries:                             123263770 (205434.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0124s
    total number of events:              12326377

Latency (ms):
         min:                                    1.07
         avg:                                    1.56
         max:                                  401.77
         95th percentile:                        1.89
         sum:                             19178832.38

Threads fairness:
    events (avg/stddev):           385199.2812/5128.26
    execution time (avg/stddev):   599.3385/0.03