results/r5-b_rw.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 2344.77 qps: 46954.70 (r/w/o: 32876.21/9385.34/4693.15) lat (ms,95%): 33.72 err/s: 0.40 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2451.53 qps: 49030.91 (r/w/o: 34325.59/9801.56/4903.76) lat (ms,95%): 30.26 err/s: 0.70 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2511.20 qps: 50245.96 (r/w/o: 35168.82/10054.29/5022.85) lat (ms,95%): 28.67 err/s: 0.45 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2530.80 qps: 50596.23 (r/w/o: 35418.50/10116.54/5061.19) lat (ms,95%): 28.67 err/s: 0.65 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2504.84 qps: 50132.65 (r/w/o: 35097.55/10023.57/5011.54) lat (ms,95%): 29.72 err/s: 0.80 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2565.43 qps: 51292.95 (r/w/o: 35902.25/10258.73/5131.96) lat (ms,95%): 28.16 err/s: 1.15 reconn/s: 0.00
[ 140s ] thds: 64 tps: 2579.26 qps: 51603.83 (r/w/o: 36124.05/10320.91/5158.88) lat (ms,95%): 28.16 err/s: 0.90 reconn/s: 0.00
[ 160s ] thds: 64 tps: 2577.86 qps: 51612.72 (r/w/o: 36133.90/10321.64/5157.17) lat (ms,95%): 28.67 err/s: 0.85 reconn/s: 0.00
[ 180s ] thds: 64 tps: 2584.27 qps: 51655.14 (r/w/o: 36158.44/10327.12/5169.58) lat (ms,95%): 28.16 err/s: 1.05 reconn/s: 0.00
[ 200s ] thds: 64 tps: 2611.95 qps: 52255.09 (r/w/o: 36581.93/10448.66/5224.50) lat (ms,95%): 28.16 err/s: 0.60 reconn/s: 0.00
[ 220s ] thds: 64 tps: 2567.14 qps: 51397.17 (r/w/o: 35979.86/10282.32/5134.99) lat (ms,95%): 28.67 err/s: 0.70 reconn/s: 0.00
[ 240s ] thds: 64 tps: 2616.58 qps: 52327.57 (r/w/o: 36637.83/10455.67/5234.06) lat (ms,95%): 28.16 err/s: 0.90 reconn/s: 0.00
[ 260s ] thds: 64 tps: 2636.85 qps: 52748.58 (r/w/o: 36925.89/10548.10/5274.60) lat (ms,95%): 27.66 err/s: 0.90 reconn/s: 0.00
[ 280s ] thds: 64 tps: 2609.69 qps: 52213.34 (r/w/o: 36552.82/10440.43/5220.09) lat (ms,95%): 28.16 err/s: 0.75 reconn/s: 0.00
[ 300s ] thds: 64 tps: 2652.75 qps: 53065.85 (r/w/o: 37139.27/10620.64/5305.95) lat (ms,95%): 27.17 err/s: 0.85 reconn/s: 0.00
[ 320s ] thds: 64 tps: 2651.31 qps: 53034.35 (r/w/o: 37132.87/10597.90/5303.57) lat (ms,95%): 27.17 err/s: 0.50 reconn/s: 0.00
[ 340s ] thds: 64 tps: 2632.41 qps: 52682.32 (r/w/o: 36873.48/10543.07/5265.76) lat (ms,95%): 27.66 err/s: 0.95 reconn/s: 0.00
[ 360s ] thds: 64 tps: 2670.59 qps: 53398.64 (r/w/o: 37386.49/10670.92/5341.23) lat (ms,95%): 27.66 err/s: 0.30 reconn/s: 0.00
[ 380s ] thds: 64 tps: 2668.19 qps: 53335.85 (r/w/o: 37325.56/10673.11/5337.18) lat (ms,95%): 27.66 err/s: 0.55 reconn/s: 0.00
[ 400s ] thds: 64 tps: 2652.66 qps: 53108.27 (r/w/o: 37183.19/10619.40/5305.68) lat (ms,95%): 27.66 err/s: 0.40 reconn/s: 0.00
[ 420s ] thds: 64 tps: 2694.78 qps: 53859.88 (r/w/o: 37697.99/10771.68/5390.21) lat (ms,95%): 26.68 err/s: 0.80 reconn/s: 0.00
[ 440s ] thds: 64 tps: 2687.72 qps: 53790.53 (r/w/o: 37662.13/10751.92/5376.48) lat (ms,95%): 27.17 err/s: 0.85 reconn/s: 0.00
[ 460s ] thds: 64 tps: 2678.50 qps: 53599.50 (r/w/o: 37524.57/10717.49/5357.45) lat (ms,95%): 27.66 err/s: 0.45 reconn/s: 0.00
[ 480s ] thds: 64 tps: 2693.39 qps: 53873.92 (r/w/o: 37714.41/10771.97/5387.54) lat (ms,95%): 27.66 err/s: 0.75 reconn/s: 0.00
[ 500s ] thds: 64 tps: 2716.81 qps: 54353.10 (r/w/o: 38041.09/10877.79/5434.22) lat (ms,95%): 26.68 err/s: 0.60 reconn/s: 0.00
[ 520s ] thds: 64 tps: 2691.91 qps: 53808.94 (r/w/o: 37665.85/10758.58/5384.51) lat (ms,95%): 27.17 err/s: 0.70 reconn/s: 0.00
[ 540s ] thds: 64 tps: 2723.64 qps: 54527.18 (r/w/o: 38177.01/10902.28/5447.89) lat (ms,95%): 27.17 err/s: 0.60 reconn/s: 0.00
[ 560s ] thds: 64 tps: 2728.37 qps: 54580.44 (r/w/o: 38203.29/10920.00/5457.15) lat (ms,95%): 26.68 err/s: 0.40 reconn/s: 0.00
[ 580s ] thds: 64 tps: 2705.02 qps: 54112.60 (r/w/o: 37880.82/10820.99/5410.80) lat (ms,95%): 27.66 err/s: 0.75 reconn/s: 0.00
[ 600s ] thds: 64 tps: 2723.56 qps: 54483.44 (r/w/o: 38140.30/10895.28/5447.86) lat (ms,95%): 26.68 err/s: 0.75 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            22032682
        write:                           6293973
        other:                           3147106
        total:                           31473761
    transactions:                        1573343 (2621.65 per sec.)
    queries:                             31473761 (52444.42 per sec.)
    ignored errors:                      420    (0.70 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1343s
    total number of events:              1573343

Latency (ms):
         min:                                    6.46
         avg:                                   24.40
         max:                                  103.02
         95th percentile:                       28.16
         sum:                             38396498.50

Threads fairness:
    events (avg/stddev):           24583.4844/28.78
    execution time (avg/stddev):   599.9453/0.01